# Создать (программно) текстовый файл, записать в него программно набор чисел, разделенных пробелами.
# Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.

in_str = "1 34 26 38 95 06 73 19"
f = open("text_5.txt", "w")
f.write(in_str)
f.close()
f = open("text_5.txt", "r")
print(str(sum(map(int, f.readline().split(' ')))))
f.close()
