# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести словарь на экран

import re

f = open("text_6.txt", "r", encoding="utf-8")
print({line[0:line.find(':') + 1]: str(sum(map(int, re.findall(r'\b\d+\b', line)))) for line in f})
f.close()
